Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F14B.tmx
Source language: en_us
Languages: zh_cn

source: Don't Marry Your Soul Mate
zh_cn: 不要和你的灵魂伴侣结婚

source: I realize that this is probably not going to be my most popular post, but it's what I feel needs to be said, so here you go.
zh_cn: 我意识到这可能不会成为我最受欢迎的邮件，但我觉得它需要被说，所以让我们开始吧。

source: I'm not a big fan of marriage.
zh_cn: 我不是婚姻的脑残粉。

source: I think marriage takes really talented dreamers and creative beings that are capable of creating real change and puts them inside this widely accepted institution of marriage, where they will then spend most of their time, emotions, magic, and valuable energy trying to be "good" citizens and live up to the impossible "perfect marriage/perfect family" illusion that has been so successfully placed in our heads.
zh_cn: 我认为婚姻需要那些有能力创造真正的变化并把他们放进被普遍接受的婚姻制度里的真正有天赋的梦想家和创造者，他们会花费他们大部分的时间，情感，魅力和宝贵的精力，努力成为“良好”公民，然后实现被成功根植在我们脑子里的那些不可能的“完美婚姻/完美家庭”的幻想。

source: Marriage also has the potential to produce a lethal feeling that we now have ownership of another soul because they said "I do," gave us a ring and signed a contract saying they would not leave us (do you ever stop to look at how crazy it all is?).
zh_cn: 婚姻也有让我们产生这种致命想法的可能性：现在我们拥有了另一个灵魂因为他们说了“我愿意”，给了我们一枚戒指并且签了一份说他们永远不会离开我们的协议。（你有没有曾经停下来想过这些念头有多么疯狂？）

source: One of the greatest deceptions we can fall victim to is the lie that we should need someone else in our life in order to be complete.
zh_cn: 使我们成为受害者的最大的谎言之一就是为了使我们的生活变得更完整，我们需要另一个人出现在我们生活中。

source: We are set up waiting for Mr. or Mrs. right to come along so that we can begin our life and be truly happy.
zh_cn: 我们被创造出来就是为了等待真命天子或者真命天女的出现以便我们可以开始我们的生活并获得真正的幸福。

source: I've been with the same man for 15 years and we still really, really like each other.
zh_cn: 我和我的丈夫在一起已经有15年了，我们仍然十分喜欢对方。

source: I think that has a lot to do with the fact that we each stand alone, beautiful, creating light, both working toward helping each other reach our individual goals.
zh_cn: 我想这很大程度上跟我们双方都独立，美丽，创造光辉,努力帮助彼此实现个人目标有关。

source: We are so incredibly different, but neither of us is fighting to change the other.
zh_cn: 我们是如此得不一样，但我们任何一方都不会为改变对方而斗争。

source: We have grown to respect and appreciate each other as we are.
zh_cn: 我们已经成长到懂得去尊重和欣赏对方真正的样子。

source: We don't need one another.
zh_cn: 我们不需要彼此。

source: We enjoy each other, but we don't need each other... there's a big difference.
zh_cn: 我们喜欢彼此，但并不需要对方......这两者有很大的区别。

source: The most unromantic line in the world is "you complete me" - it literally makes me want to scream when I hear it at weddings.
zh_cn: 世界上最不浪漫的一句话就是“你使我变得完整”，每当我在婚礼上听到这句话时，简直让我想要尖叫。

source: I want to complete myself.
zh_cn: 我想要使自己变得完整。

source: Spin solo until you are in perfect harmony with source and are able to create magic alone.
zh_cn: 独自旋转直到你能够和周围的环境和谐相处并且能够独立创造奇迹为止。

source: Then you can, if you choose, attract someone who can spin along side you.
zh_cn: 然后你可以去做，如果你做出选择，吸引另一个人在你身旁独自旋转。

source: The result is two beautiful souls who are spinning separately, but in perfect harmony... that's where magic happens!
zh_cn: 那么结果会是两个美丽的灵魂独自旋转着，但却相得益彰......这就是奇迹所在！

source: What about children?
zh_cn: 那孩子怎么办？

source: I don't believe we were all meant to have children and the pressure created by our culture to have a family is RIDICULOUS!
zh_cn: 我不相信我们每个人本意都想要孩子，而那份来自文化的让我们拥有家庭的压力非常荒谬！

source: That being said, once the decision to have children is made or made for you, then yes, it's beneficial for their sake to find a mate willing to help you give them the best life possible.
zh_cn: 这份压力告诉我们，一旦你决定要孩子了，那么，他们让你应该找到一个同伴来帮助你给孩子尽可能最好的生活的理由就变得合乎常理了。

source: That doesn't mean you both live in the same house, but you are committed to working together peacefully to make sure the children are given the support they need to grow into healthy, confident and emotionally stable members of society.
zh_cn: 这并不意味着你们要住在一间房子里，但是你们要承诺一起工作以保证给予孩子成为一名健康的、自信的，情绪稳定的社会成员的支持。

source: If you do get married, because that's what you want... WONDERFUL!
zh_cn: 如果你真的结婚了，因为这是你想要的精彩。

source: Just make sure to keep your expectations realistic and be open and honest about how you're feeling.
zh_cn: 那么你就努力使你的期望成真并且诚实面对你真实的感受吧。

source: It's unhealthy for anyone to be in a long term relationship where they feel trapped and miserable.
zh_cn: 长期处于一段漫长的不和谐的让人感受到痛苦受挫的关系不利于身心健康。

source: It's also why we have so much trauma related to relationships in our life that didn't last... mother/father, first love, etc. because we had this fairy tale image of what love looks like and when it turned out different we were crushed.
zh_cn: 这也是为什么在我们的生活中我们有那么多的创伤与我们父母亲，初恋情人等等的关系有关。因为当我们分手后，我们曾经有的关于什么是爱的童话想象就会变得不一样了。

source: Don't marry your soul mate
zh_cn: 不要和你的灵魂伴侣结婚

source: Billy is a good friend (the best, really).
zh_cn: 比利是我的一个好朋友（真的是最好的那种）。

source: He's the man that thinks I'm wonderful, amazing and incredibly gorgeous.
zh_cn: 他认为我是一个极好的，惊奇的并且令人难以置信的出色的人。

source: He's all in and ready to help and support me and this unit in anyway he can.
zh_cn: 他随时准备好倾其所有来帮助和支持我，这点我相信他无人如何都会做到的。

source: He's the most incredible father and teammate.
zh_cn: 他是最令人不可思议的父亲和队友。

source: We are perfect for each other in so many ways.
zh_cn: 我们在很多方面都是天造地设的一对。

source: We bring out the best in each other almost always.
zh_cn: 我们几乎总是给对方最好的。

source: We don't need or cling to each other and are able to stand alone even though we'd prefer to stand together.
zh_cn: 我们不需要依靠对方并且即使我们更喜欢站在一起，我们也可以独立站着。

source: This relationship is easy and gets shit done.
zh_cn: 这种关系简单并且非常成熟。

source: Billy is sweet, patient... downright wonderful and I love him, but he's not my soul mate in some kind of mystical, ancient bond, finish your sentences kind of way.
zh_cn: 比利体贴，有耐心，彻头彻尾的好并且我爱他，但是从某种神秘并且古老的联系来说，他不是我的灵魂伴侣，他的存在只是为了以某种方式完整我的人生。

source: We are together in a perfectly unique union that has a purpose completely unique to itself.
zh_cn: 在具有完全独特的自身目的的一个完全独特的联盟中，我们是在一起的。

source: What is a soul mate?
zh_cn: 什么是灵魂伴侣？

source: Is there such a thing?
zh_cn: 是否有这样的一个东西？

source: Each of us will answer these questions differently depending on your belief system.
zh_cn: 我们每一个人都会依据自己的信仰给出不同的回答。

source: I personally believe soul mates are people we've been connected to since the beginning of time.
zh_cn: 我个人认为灵魂伴侣就是从一开始的时候就和我们连接在一起的人。

source: People that weave in and out of this massive interconnected web that is a collection of our many lives.
zh_cn: 人们迂回曲折绕道进出这个由我们许多人的生命集合的庞大的互联网。

source: Souls matched perfectly with ours to help us grow.
zh_cn: 灵魂完美地与我们自身相配以帮助我们成长。

source: Our soul mate or mates aren't always meant to be our lovers.
zh_cn: 我们的灵魂伴侣不总是指的是我们的情人。

source: I think this is really important for all of us to understand.
zh_cn: 我认为这对于我们所有人去理解它是非常重要的。

source: As a culture we seem to struggle with understanding deep relationships that aren't sexual or unions that aren't romantic, but have a greater purpose.
zh_cn: 作为一种文化，我们似乎并不是为了解性或工会或浪漫之间的深层关系，而是有一个更大的目标。

source: Any deep connection sensed between two people is meant to become romantic, right?
zh_cn: 两个人之间任何的深层联系感应是为了变得浪漫，对吗？

source: No.
zh_cn: 不对。

source: There are all kinds of connections in this wild life.
zh_cn: 在这个疯狂的世界上还有各种各样的联系。

source: I believe soul mates exist and they will show up in each life when you need them.
zh_cn: 我相信灵魂伴侣的存在并且当你需要他们的时候，他们会出现在你的生命中。

source: They come to push you, challenge you, mirror your shit, wake you up and push you forward.
zh_cn: 他们来给你施加压力，挑战你，反映你不足的地方，叫醒你，推动你前进。

source: Honestly, you're probably better off not marrying that person, because then you'll get caught up in creating the ideal marriage (WHATEVER THE HELL THAT EVEN IS) and forget why your souls were put together from the beginning.
zh_cn: 说实话，不和那样的人结婚，你可能会过得更好，因为这样你会专注于创造你的理想婚姻（不管，即使是地狱）忘记为什么从一开始你的灵魂要和你放在一起。

source: You'll all too easily forget that your job is to help each other evolve as quickly as possible not torture each other into this bizarre role we've created that a husband and wife ought to play.
zh_cn: 你会很容易就忘了，你的工作是帮助对方尽快演变为不互相折磨的奇怪角色，而是我们已经创建好的一个丈夫和一个妻子应该扮演的角色。

source: Because who knows what that looks like for each of us.
zh_cn: 因为谁知道那对我们每个人来说会是什么样子。

source: Lord knows we've all experienced interesting versions of those characters.
zh_cn: 上帝知道我们都经历过这些角色的有趣转变。

source: It's this idea that one person is supposed to meet all of our needs that sets us up for heartache and disappointment.
zh_cn: 正是这种想法，一个人应该满足我们弥补心痛和失望的所有需求。

source: Instead, why don't we look first at what it is we would like our relationship with another human to create or accomplish.
zh_cn: 相反，我们为什么不先看看我们希望和另一个人建立或完成的关系会是什么样的。

source: Then believe that the universe will send us a perfect match for that goal.
zh_cn: 然后相信宇宙会送我们一个和那个目标相匹配的完美的人。

source: If you just want to have great sex and travel around the world then you will call forth a completely different soul than if you want to raise a family.
zh_cn: 如果你只是想有一个异性的人然后一起环游世界，那么比起你想要生儿育女，你将召唤出一个完全不同的灵魂。

source: If you aren't sure, just trust me on this one.
zh_cn: 如果你不确定，那么就相信我这一次。

source: Knowing exactly what we want is the first step to being able to create the most magical union ever.
zh_cn: 确切地知道我们想要的是什么的第一步是能够不断创造出最奇幻的结合。

source: Listen, I'm not an expert, and I certainly haven't figured it all out.
zh_cn: 听着，我不是一个专家，当然我自己也没有想清楚这一切。

source: I do know one thing for certain though, and that is the reality that what we are doing is working.
zh_cn: 但是，我确实确信一件事，那就是我们正在做的工作是现实。

source: How many happy couples do you know?
zh_cn: 你知道有多少幸福的伴侣？

source: Okay. How many do you know that have been together longer than a few years and have kids?
zh_cn: 好吧，有多少是你知道的已经在一起几年并且有孩子的？

source: Not just comfortable, but truly happy.
zh_cn: 不仅仅是生活得舒服，是真正的幸福。
